tutorial/constantAngleSlopeUProfileInletNonNewtonianSoilNonNewtonianFluidAvalancheFoam/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	leftInletWall
    {
		//type			zeroGradient;
		type			timeVaryingMappedFixedValue;
    }

	rightWall
    {
        type            fluxCorrectedVelocity;
        value           uniform (0 0 0);
    }

	leftWall
    {
        type            noSlip;
    }

	lowerWall
    {
        type            noSlip;
    }

	atmosphere
    {
        type            fluxCorrectedVelocity;
        value           uniform (0 0 0);
    }

	sides
    {
        type            empty;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
