tutorial/constantAngleSlopeUProfileInletNonNewtonianSoilNonNewtonianFluidAvalancheFoam/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir
runApplication blockMesh
runApplication setFields
runApplication $(getApplication)
#runApplication decomposePar -constant
#runParallel $(getApplication)
#runApplication reconstructPar
touch foam.foam

#------------------------------------------------------------------------------
